In [1]:
import pandas as pd
import numpy as np

In [39]:
df = pd.read_csv("data.csv")
df.head()

  FirstName LastName   Age  Sex preTestScore postTestScore location
0       abc      mno  12.0    m         90.0          65.0      NaN
1       NaN      NaN   NaN  NaN         90.0             ?      NaN
2       ghi      pqr  12.0    f            -          65.0        ?
3       jkl      stu  12.0    f         90.0          62.0      NaN
4       mno      vwx  12.0    m         89.0          63.0      NaN

In [4]:
df.shape

(5, 7)

In [5]:
df.describe()

        Age
count   4.0
mean   12.0
std     0.0
min    12.0
25%    12.0
50%    12.0
75%    12.0
max    12.0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   FirstName      4 non-null      object
 1   LastName       4 non-null      object
 2   Age            4 non-null      float64
 3   Sex            4 non-null      object
 4   preTestScore   5 non-null      object
 5   postTestScore  5 non-null      object
 6   location       1 non-null      object
dtypes: float64(1), object(6)
memory usage: 408.0+ bytes

#### Idenfication of missing values

In [7]:
df.isnull()

   FirstName  LastName    Age    Sex  preTestScore  postTestScore  location
0      False     False  False  False         False          False      True
1       True      True   True   True         False          False      True
2      False     False  False  False         False          False     False
3      False     False  False  False         False          False      True
4      False     False  False  False         False          False      True

In [8]:
#Columnwiseidentification
df.isnull().sum()

FirstName        1
LastName         1
Age              1
Sex              1
preTestScore     0
postTestScore    0
location         4
dtype: int64

In [9]:
df.isnull().all(axis = 0) #all_missing_in_columns

FirstName        False
LastName         False
Age              False
Sex              False
preTestScore     False
postTestScore    False
location         False
dtype: bool

In [11]:
df.isnull().any(axis = 0) #atleast_two_missing_in_columns

FirstName         True
LastName          True
Age               True
Sex               True
preTestScore     False
postTestScore    False
location          True
dtype: bool

In [12]:
df.isnull().any(axis = 1) #atleast_two_missing_in_rows

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [14]:
df.isnull().all(axis = 1) #all_two_missing_in_rows

0    False
1    False
2    False
3    False
4    False
dtype: bool

#### Column wise Treatment

In [17]:
round(100*df.isnull().sum()/len(df.index),2)

FirstName        20.0
LastName         20.0
Age              20.0
Sex              20.0
preTestScore      0.0
postTestScore     0.0
location         80.0
dtype: float64

In [53]:
df.dropna(axis= 'columns',how= 'all',inplace = True)

In [54]:
round(100*(df.isnull().sum()/len(df.index)), 2)

FirstName        20.0
LastName         20.0
Age              20.0
Sex              20.0
preTestScore      0.0
postTestScore     0.0
location         80.0
dtype: float64

In [55]:
df

  FirstName LastName   Age  Sex preTestScore postTestScore location
0       abc      mno  12.0    m         90.0          65.0      NaN
1       NaN      NaN   NaN  NaN         90.0             ?      NaN
2       ghi      pqr  12.0    f            -          65.0        ?
3       jkl      stu  12.0    f         90.0          62.0      NaN
4       mno      vwx  12.0    m         89.0          63.0      NaN

In [56]:
miss_values = ['-','?']

In [57]:
df.replace(miss_values,np.nan,inplace = True)

In [58]:
df

  FirstName LastName   Age  Sex preTestScore postTestScore  location
0       abc      mno  12.0    m         90.0          65.0       NaN
1       NaN      NaN   NaN  NaN         90.0           NaN       NaN
2       ghi      pqr  12.0    f          NaN          65.0       NaN
3       jkl      stu  12.0    f         90.0          62.0       NaN
4       mno      vwx  12.0    m         89.0          63.0       NaN

In [59]:
round(100*df.isnull().sum()/len(df.index),2)

FirstName         20.0
LastName          20.0
Age               20.0
Sex               20.0
preTestScore      20.0
postTestScore     20.0
location         100.0
dtype: float64

In [63]:
df.dropna(axis = 1, how = 'all',inplace = True)

In [64]:
round(100*df.isnull().sum()/len(df.index),2)

FirstName        20.0
LastName         20.0
Age              20.0
Sex              20.0
preTestScore     20.0
postTestScore    20.0
dtype: float64

#### Row wise treatment

In [66]:
df[df.isnull().sum(axis = 1) >= 4]

  FirstName LastName  Age  Sex preTestScore postTestScore
1       NaN      NaN  NaN  NaN         90.0           NaN

In [69]:
r = df[df.isnull().sum(axis = 1) <= 4]

In [70]:
round(100*r.isnull().sum()/len(r.index),2)

FirstName         0.0
LastName          0.0
Age               0.0
Sex               0.0
preTestScore     25.0
postTestScore     0.0
dtype: float64

In [71]:
df.head()

  FirstName LastName   Age  Sex preTestScore postTestScore
0       abc      mno  12.0    m         90.0          65.0
1       NaN      NaN   NaN  NaN         90.0           NaN
2       ghi      pqr  12.0    f          NaN          65.0
3       jkl      stu  12.0    f         90.0          62.0
4       mno      vwx  12.0    m         89.0          63.0

In [77]:
df["preTestScore"] =df["preTestScore"].apply(pd.to_numeric)

In [79]:
df["preTestScore"].describe()

count     4.00
mean     89.75
std       0.50
min      89.00
25%      89.75
50%      90.00
75%      90.00
max      90.00
Name: preTestScore, dtype: float64

In [80]:
df["preTestScore"].fillna(df["preTestScore"].mean(),inplace = True)

In [81]:
df

  FirstName LastName   Age  Sex  preTestScore postTestScore
0       abc      mno  12.0    m         90.00          65.0
1       NaN      NaN   NaN  NaN         90.00           NaN
2       ghi      pqr  12.0    f         89.75          65.0
3       jkl      stu  12.0    f         90.00          62.0
4       mno      vwx  12.0    m         89.00          63.0

In [86]:
df.dropna(inplace = True)

In [87]:
df

  FirstName LastName   Age Sex  preTestScore postTestScore
0       abc      mno  12.0   m         90.00          65.0
2       ghi      pqr  12.0   f         89.75          65.0
3       jkl      stu  12.0   f         90.00          62.0
4       mno      vwx  12.0   m         89.00          63.0